"use server"

import { query } from "@solidjs/router"

const mock_data = [
    {
        id: 0,
        title: "ლორემ იპსუმ მისცვივდნენ მოგცემდე",
        thumbnail: "/course-image.jpg",
        courseLength: "3 თვე",
        instructor: "სტუ სტუდენტები",
        rating: 4.9,
        monthly_access_price: 24.99,
        students: 1480,
        description: "ლორემ იპსუმ მისცვივდნენ მოგცემდე მხდალი მივიღებდი დავაშავე მოეგო. მისცვივდნენ მოგცემდე მხდალი მივიღებდი დავაშავე მოეგო ვაკოცე აზრები დავკარგავ მაკისრია ყინვა მესერზე მომტანი მომმართავდა. მისცვივდნენ მოგცემდე მხდალი მივიღებდი დავაშავე, მოეგო ვაკოცე აზრები, დავკარგავ მაკისრია ყინვა მესერზე, მომტანი, მომმართავდა დაგჭირდეთ."
    },
    {
        id: 1,
        title: "ლორემ იპსუმ მისცვივდნენ მოგცემდე",
        thumbnail: "https://picsum.photos/700/705",
        courseLength: "3 თვე",
        instructor: "სტუ სტუდენტები",
        rating: 4.9,
        monthly_access_price: 24.99,
        students: 1480,
        description: "ლორემ იპსუმ მისცვივდნენ მოგცემდე მხდალი მივიღებდი დავაშავე მოეგო. მისცვივდნენ მოგცემდე მხდალი მივიღებდი დავაშავე მოეგო ვაკოცე აზრები დავკარგავ მაკისრია ყინვა მესერზე მომტანი მომმართავდა. მისცვივდნენ მოგცემდე მხდალი მივიღებდი დავაშავე, მოეგო ვაკოცე აზრები, დავკარგავ მაკისრია ყინვა მესერზე, მომტანი, მომმართავდა დაგჭირდეთ."
    },
    {
        id: 2,
        title: "ლორემ იპსუმ მისცვივდნენ მოგცემდე",
        thumbnail: "https://picsum.photos/700/704",
        courseLength: "3 თვე",
        instructor: "სტუ სტუდენტები",
        rating: 4.9,
        monthly_access_price: 24.99,
        students: 1480,
        description: "ლორემ იპსუმ მისცვივდნენ მოგცემდე მხდალი მივიღებდი დავაშავე მოეგო. მისცვივდნენ მოგცემდე მხდალი მივიღებდი დავაშავე მოეგო ვაკოცე აზრები დავკარგავ მაკისრია ყინვა მესერზე მომტანი მომმართავდა. მისცვივდნენ მოგცემდე მხდალი მივიღებდი დავაშავე, მოეგო ვაკოცე აზრები, დავკარგავ მაკისრია ყინვა მესერზე, მომტანი, მომმართავდა დაგჭირდეთ."
    },
    {
        id: 3,
        title: "ლორემ იპსუმ მისცვივდნენ მოგცემდე",
        thumbnail: "https://picsum.photos/700/703",
        courseLength: "3 თვე",
        instructor: "სტუ სტუდენტები",
        rating: 4.9,
        monthly_access_price: 24.99,
        students: 1480,
        description: "ლორემ იპსუმ მისცვივდნენ მოგცემდე მხდალი მივიღებდი დავაშავე მოეგო. მისცვივდნენ მოგცემდე მხდალი მივიღებდი დავაშავე მოეგო ვაკოცე აზრები დავკარგავ მაკისრია ყინვა მესერზე მომტანი მომმართავდა. მისცვივდნენ მოგცემდე მხდალი მივიღებდი დავაშავე, მოეგო ვაკოცე აზრები, დავკარგავ მაკისრია ყინვა მესერზე, მომტანი, მომმართავდა დაგჭირდეთ."
    },
    {
        id: 4,
        title: "ლორემ იპსუმ მისცვივდნენ მოგცემდე",
        thumbnail: "https://picsum.photos/700/702",
        courseLength: "3 თვე",
        instructor: "სტუ სტუდენტები",
        rating: 4.9,
        monthly_access_price: 24.99,
        students: 1480,
        description: "ლორემ იპსუმ მისცვივდნენ მოგცემდე მხდალი მივიღებდი დავაშავე მოეგო. მისცვივდნენ მოგცემდე მხდალი მივიღებდი დავაშავე მოეგო ვაკოცე აზრები დავკარგავ მაკისრია ყინვა მესერზე მომტანი მომმართავდა. მისცვივდნენ მოგცემდე მხდალი მივიღებდი დავაშავე, მოეგო ვაკოცე აზრები, დავკარგავ მაკისრია ყინვა მესერზე, მომტანი, მომმართავდა დაგჭირდეთ."
    },
    {
        id: 5,
        title: "ლორემ იპსუმ მისცვივდნენ მოგცემდე",
        thumbnail: "https://picsum.photos/700/701",
        courseLength: "3 თვე",
        instructor: "სტუ სტუდენტები",
        rating: 4.9,
        monthly_access_price: 24.99,
        students: 1480,
        description: "ლორემ იპსუმ მისცვივდნენ მოგცემდე მხდალი მივიღებდი დავაშავე მოეგო. მისცვივდნენ მოგცემდე მხდალი მივიღებდი დავაშავე მოეგო ვაკოცე აზრები დავკარგავ მაკისრია ყინვა მესერზე მომტანი მომმართავდა. მისცვივდნენ მოგცემდე მხდალი მივიღებდი დავაშავე, მოეგო ვაკოცე აზრები, დავკარგავ მაკისრია ყინვა მესერზე, მომტანი, მომმართავდა დაგჭირდეთ."
    },
]

export const get_landing_courses = query(async () => {
    try {
        // const is_auth = await authenticate_user()
        return {
            is_auth: false,
            mock_data
        }
    } catch (error) {
        console.log('landing_error: ', error)
    }
}, 'landing-courses')

export const get_course_detail = query(async (id) => {
    try {
        return mock_data[id]
    } catch (error) {
        console.log(error)
    }
}, "course")